<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #19 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7348978683","plan_hash":"159a44a836136b022ffdc290285a26326ea207f7e343ad375c7437c5955c3994","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:17" -> "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:18"
#        (16 unchanged attributes hidden)

-       load_balancer {
-           container_name   = "dev_FastAPI_image" -> null
-           container_port   = 5000 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
        }
+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_lb_listener.listerner will be created
+   resource "aws_lb_listener" "listerner" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:eu-central-1:806066816337:certificate/ce157388-cd24-4841-9044-fbd2ab762400"
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-2016-08"
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.target_group will be created
+   resource "aws_lb_target_group" "target_group" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "alb-target-group-dev"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTPS"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #19](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7348978683)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>